{
  "AllIds": [
    600001,
    600002,
    600003,
    600004,
    600005,
    600006,
    600007,
    600008,
    600009,
    600010,
    600011,
    600012,
    600013,
    600014,
    600015,
    600016,
    600017,
    600018,
    600019,
    600020,
    600021,
    600022,
    600023,
    600024,
    600025,
    600026,
    600027,
    600028,
    600029,
    600030,
    600031,
    600032,
    600033,
    600034,
    600035,
    600036,
    600037,
    600038,
    600039,
    600040,
    600041,
    600042,
    600043,
    600044,
    600045,
    600046,
    600047,
    600048,
    600049,
    600050,
    600051,
    600052,
    600053,
    600054,
    600055,
    600056,
    600057,
    600058,
    600059,
    600060,
    600061,
    600062,
    600063,
    600064,
    600065,
    600066,
    600067,
    600068,
    600069,
    600070,
    600071,
    600072,
    600073,
    600074,
    600075,
    600076,
    600077,
    600078,
    600079,
    600080,
    600081,
    600082,
    600083,
    600084,
    600085,
    600086,
    600087,
    600088,
    600089,
    600090,
    600091,
    600092,
    600093,
    600094,
    600095,
    600096,
    600097,
    600098,
    600099,
    600100,
    600101,
    600102,
    600103,
    600104,
    600105,
    600106,
    600107,
    600108,
    600109,
    600110,
    600111,
    600112,
    600113,
    600114,
    600115,
    600116,
    600117,
    600118,
    600119,
    600120,
    600121,
    600122,
    600123,
    600124,
    600125,
    600126,
    600127,
    600128,
    600129,
    600130,
    600131,
    600132,
    600133,
    600134,
    600135,
    600136,
    600137,
    600138,
    600139,
    600140,
    600141,
    600142,
    600143,
    600144,
    600145,
    600146,
    600147,
    600148,
    600149,
    600150,
    600151,
    600152,
    600153,
    600154,
    600155,
    600156,
    600157
  ],
  "Data": {
    "600001": {
      "id": 600001,
      "text": "Music Box of Time"
    },
    "600002": {
      "id": 600002,
      "text": "Pot"
    },
    "600003": {
      "id": 600003,
      "text": "Chrono Tower"
    },
    "600004": {
      "id": 600004,
      "text": "Irminsul"
    },
    "600005": {
      "id": 600005,
      "text": "Snegurochka"
    },
    "600006": {
      "id": 600006,
      "text": "Beastbone Ring"
    },
    "600007": {
      "id": 600007,
      "text": "Sturdy Wood"
    },
    "600008": {
      "id": 600008,
      "text": "Spear of the Frost Chivalric Order"
    },
    "600009": {
      "id": 600009,
      "text": "Fang of the Dire Wolf"
    },
    "600010": {
      "id": 600010,
      "text": "Giant Arrow"
    },
    "600011": {
      "id": 600011,
      "text": "Plush Vest"
    },
    "600012": {
      "id": 600012,
      "text": "Saintess Veil"
    },
    "600013": {
      "id": 600013,
      "text": "Transcripts of the Scrolls"
    },
    "600014": {
      "id": 600014,
      "text": "Flame Emblem"
    },
    "600015": {
      "id": 600015,
      "text": "Wand of Radiance"
    },
    "600016": {
      "id": 600016,
      "text": "Mysterious Christmas Gift"
    },
    "600017": {
      "id": 600017,
      "text": "Lost Badge"
    },
    "600018": {
      "id": 600018,
      "text": "Fox's Food Cache"
    },
    "600019": {
      "id": 600019,
      "text": "Ice Cryolite"
    },
    "600020": {
      "id": 600020,
      "text": "Sturdy Hunting Bow"
    },
    "600021": {
      "id": 600021,
      "text": "Eternal Ice"
    },
    "600022": {
      "id": 600022,
      "text": "Frost of Absolute Zero"
    },
    "600023": {
      "id": 600023,
      "text": "This exquisite and wonderful instrument can produce melodious tunes, leading you to a dreamworld. You can explore the Dreamworld through the Hall of Origin now."
    },
    "600024": {
      "id": 600024,
      "text": "A fine pot, with its owner's name inscribed on it."
    },
    "600025": {
      "id": 600025,
      "text": "Chapter 1"
    },
    "600026": {
      "id": 600026,
      "text": "Chapter 2"
    },
    "600027": {
      "id": 600027,
      "text": "Chapter 3"
    },
    "600028": {
      "id": 600028,
      "text": "A ring made of the hard bones of beasts in a rugged style. It seems to be a token for contact of some organization, used to identify and distinguish members of other groups."
    },
    "600029": {
      "id": 600029,
      "text": "This sturdy wood is good for making a crutch. Perhaps a villager may need it."
    },
    "600030": {
      "id": 600030,
      "text": "Standard gear of a fanatic chivalric order. The lance represents God's sanctions. This weapon seems to be able to seal off feelings, making its holder stony-hearted."
    },
    "600031": {
      "id": 600031,
      "text": "Residual magic on it, this tooth is said to belong to a vicious wolf in ancient times that was punished for biting a highly elevated man."
    },
    "600032": {
      "id": 600032,
      "text": "A giant arrow five times larger than a normal one. You can imagine that it must match a giant bow, even few heroes can draw it."
    },
    "600033": {
      "id": 600033,
      "text": "Made of thick fur, the clothes can keep you warm despite its rough look. Wearing it, you will no longer tumble in the snow."
    },
    "600034": {
      "id": 600034,
      "text": "Snow-like muslin. Light and soft, it can guide the wind and snow to cover the earth."
    },
    "600035": {
      "id": 600035,
      "text": "The defective scrolls found in the Church's library, painted with a black laurel on its back cover. The incomplete phrases on it are vaguely recognizable: \"chrono tower\", \"despair of the abyss\", \"forbidden magic\"."
    },
    "600036": {
      "id": 600036,
      "text": "The badge dropped by Anemone."
    },
    "600037": {
      "id": 600037,
      "text": "A magic wand in its original appearance after being infused with magic, engraved with the faintly visible words, \"noble knights, guard this world like rain\". Since ancient times, only the chosen knight can open the door of the ruins and have an audience with the noble."
    },
    "600038": {
      "id": 600038,
      "text": "A special gift to the Witch. Merry Christmas! (The Chest contains a limited-edition Avatar Frame and 3,000 Souls.)"
    },
    "600039": {
      "id": 600039,
      "text": "A badge left by the monster in the enchantment. On its surface, blazing fire looms."
    },
    "600040": {
      "id": 600040,
      "text": "The food that the little fox and its companions buried under the snowdrift. Enough to support another migration."
    },
    "600041": {
      "id": 600041,
      "text": "A rare ore from which Ice Crystal Ore can be obtained."
    },
    "600042": {
      "id": 600042,
      "text": "An undecorated hunting bow. It is the most common hunting tool of Snegurochka dwellers."
    },
    "600043": {
      "id": 600043,
      "text": "An ice crystal that never melts."
    },
    "600044": {
      "id": 600044,
      "text": "A magical barrier capable of sealing out heat and explosions, made of ice crystals that never thaw."
    },
    "600045": {
      "id": 600045,
      "text": "Here..."
    },
    "600046": {
      "id": 600046,
      "text": "Its frame reads: My followers, come to me through the shackle of chronospaces. My foes, step inside and you shall lose all hope. —Ereshkigal"
    },
    "600047": {
      "id": 600047,
      "text": "..."
    },
    "600048": {
      "id": 600048,
      "text": "The ripped paper writes: It's been three days since I came into the tower for treasure. Found no way out... I hope the captain can help us out..."
    },
    "600049": {
      "id": 600049,
      "text": "The ripped paper writes: ... it stinks of an eerie aura here. I hope danger will not fall upon me..."
    },
    "600050": {
      "id": 600050,
      "text": "Bottles and jars are spread on the desk, full of a strange liquid..."
    },
    "600051": {
      "id": 600051,
      "text": "... a low groaning."
    },
    "600052": {
      "id": 600052,
      "text": "This rag looks familiar..."
    },
    "600053": {
      "id": 600053,
      "text": "..."
    },
    "600054": {
      "id": 600054,
      "text": "The mirror shards are assimilated into the body accompanied by a shimmer."
    },
    "600055": {
      "id": 600055,
      "text": "It seems the shards of the mirror merge into the body."
    },
    "600056": {
      "id": 600056,
      "text": "The monument inscribed: God's blessings stay in Irminsul—A Glorious Country, the Celestial Year 473, Monument of the Harvest."
    },
    "600057": {
      "id": 600057,
      "text": "Ripped page: The plants in the woods nearby have been overgrowing since yesterday. The vines in the courtyard have crept from outside of the window into the room."
    },
    "600058": {
      "id": 600058,
      "text": "Even the river outside the village has turned green today. Unrest fills me. I hope everything is all right."
    },
    "600059": {
      "id": 600059,
      "text": "The monument inscribed: No harvests. The great Protector is furious. The Celestial Year 474."
    },
    "600060": {
      "id": 600060,
      "text": "Ripped page: People around me became abnormal. Neighbors stopped going to work. Some even smashed their furniture."
    },
    "600061": {
      "id": 600061,
      "text": "Horrible! The great Protector, save the poor, please!"
    },
    "600062": {
      "id": 600062,
      "text": "The words on the ripped page are barely legible: Unbelievable. Even I... the feeling... terrible... My hands..."
    },
    "600063": {
      "id": 600063,
      "text": "Ah! What have I become? The great Protector, why do you shower this catastrophe on us?"
    },
    "600064": {
      "id": 600064,
      "text": "Ripped page: Ah, it hurts! I had to run out. It's terrible. How come my Vivian attacked me with a knife!"
    },
    "600065": {
      "id": 600065,
      "text": "Why is this happening? Why?"
    },
    "600066": {
      "id": 600066,
      "text": "Check the caterpillar over there."
    },
    "600067": {
      "id": 600067,
      "text": "Market—Esha. May the Protector shelter this land."
    },
    "600068": {
      "id": 600068,
      "text": "May it flourish. May the Protector protect us."
    },
    "600069": {
      "id": 600069,
      "text": "Dear... We household guards have not seen the Protector for some time... She locked herself in... rumors... strange magic study..."
    },
    "600070": {
      "id": 600070,
      "text": "As a household guard, glory prevents me from questioning my Lord... My faith seems not firm enough..."
    },
    "600071": {
      "id": 600071,
      "text": "Dear... Rumors are spreading among the guards... How can a glorious household guard doubt the Protector?"
    },
    "600072": {
      "id": 600072,
      "text": "The Protector has been blessing Irminsul... My sword aims to guard this land..."
    },
    "600073": {
      "id": 600073,
      "text": "... How... This whole tragedy... is the cause of the Protector... The magic... suffering..."
    },
    "600074": {
      "id": 600074,
      "text": "The barrier cannot be opened."
    },
    "600075": {
      "id": 600075,
      "text": "The mirror is activated. (You can go into Irminsul through the entrance at the bottom of the tower.)"
    },
    "600076": {
      "id": 600076,
      "text": "Those who wish to get in"
    },
    "600077": {
      "id": 600077,
      "text": "Those who wish to get in, \npresent all the lights."
    },
    "600078": {
      "id": 600078,
      "text": "The chest is locked..."
    },
    "600079": {
      "id": 600079,
      "text": "Offer the light of emerald green, \nthen the light of dark purple."
    },
    "600080": {
      "id": 600080,
      "text": "Then the light of azure blue, \nfinally the light of pale yellow."
    },
    "600081": {
      "id": 600081,
      "text": "Pray wholeheartedly"
    },
    "600082": {
      "id": 600082,
      "text": "Without orders, \npray wholeheartedly."
    },
    "600083": {
      "id": 600083,
      "text": "It seems there are people living in the village over the fence."
    },
    "600084": {
      "id": 600084,
      "text": "Your voice is swallowed by the blizzard. No one answers the door. Check other places."
    },
    "600085": {
      "id": 600085,
      "text": "It seems the man over there needs your help."
    },
    "600086": {
      "id": 600086,
      "text": "Warm clothes"
    },
    "600087": {
      "id": 600087,
      "text": "Wand"
    },
    "600088": {
      "id": 600088,
      "text": "This wand looks ordinary, with words carved on it, though barely readable. It's said to a token that a nobleman bestowed to a knight for his chivalrous deeds and absolute loyalty."
    },
    "600089": {
      "id": 600089,
      "text": "Sinmara's Raw Stone"
    },
    "600090": {
      "id": 600090,
      "text": "The quartz of the magic of Sinmara the Inferno, is capable of invoking endless lava that can devour the entire earth."
    },
    "600091": {
      "id": 600091,
      "text": "Witch Notebook: Homesick"
    },
    "600092": {
      "id": 600092,
      "text": "According to the Treant's description, his hometown seems to be at the northern end of Irene Island, surrounded by water."
    },
    "600093": {
      "id": 600093,
      "text": "Chapter 4"
    },
    "600094": {
      "id": 600094,
      "text": "Those who wish to get in"
    },
    "600095": {
      "id": 600095,
      "text": "Offer the light of emerald green"
    },
    "600096": {
      "id": 600096,
      "text": "Then the light of dark purple"
    },
    "600097": {
      "id": 600097,
      "text": "Then the light of azure blue"
    },
    "600098": {
      "id": 600098,
      "text": "Finally the light of pale yellow"
    },
    "600099": {
      "id": 600099,
      "text": "Glowing Tree Seeds"
    },
    "600100": {
      "id": 600100,
      "text": "Strange seeds full of magic. Bring them back to the Hall of Origin."
    },
    "600101": {
      "id": 600101,
      "text": "Go forward and touch the mirror."
    },
    "600102": {
      "id": 600102,
      "text": "Snegurochka, Protectee of Endless Blizzards"
    },
    "600103": {
      "id": 600103,
      "text": "Hunting Grounds"
    },
    "600104": {
      "id": 600104,
      "text": "Danger! Bear Area!"
    },
    "600105": {
      "id": 600105,
      "text": "Camp of the Frost Chivalric Order"
    },
    "600106": {
      "id": 600106,
      "text": "Glacial Castle"
    },
    "600107": {
      "id": 600107,
      "text": "It's bleeding. She can't keep fighting like this..."
    },
    "600108": {
      "id": 600108,
      "text": "Glowing Blue Ember"
    },
    "600109": {
      "id": 600109,
      "text": "The blue powder, left by the vaporized monsters near the Chrono Tower. Still holds the unique magic from the tower."
    },
    "600110": {
      "id": 600110,
      "text": "Step close to the mirror, and tap the button at the lower right corner to adjust the light path."
    },
    "600111": {
      "id": 600111,
      "text": "Snegurochka"
    },
    "600112": {
      "id": 600112,
      "text": "Cassiel"
    },
    "600113": {
      "id": 600113,
      "text": "Chapter 4"
    },
    "600114": {
      "id": 600114,
      "text": "Chapter 5"
    },
    "600115": {
      "id": 600115,
      "text": "Eddine, an artificial butterfly-like monster, existing only in the Dreamworld. It flutters its wings gently, giving off a mysterious aura."
    },
    "600116": {
      "id": 600116,
      "text": "Whenever Eddine shows up, swarms of fluorescent butterflies encircled it, flapping their wings with Eddine, and flying into the Dreamworld."
    },
    "600117": {
      "id": 600117,
      "text": "No words more than \"fantastical\" fit Eddine, but it's also real. It's as if a person getting into the dream is transformed into a butterfly. Eddine's whispers lingering around, guided by the swarm, and together fly into the depths of the Dreamworld."
    },
    "600118": {
      "id": 600118,
      "text": "In each encounter with Eddine, different things would happen. Most likely, different moods shaped diverse scenes. The dim glistening of butterflies would make you forget the passing time, and even slumber into a dream-like state."
    },
    "600119": {
      "id": 600119,
      "text": "Though faintly, the butterflies would flap their wings to produce a subtle wind. As a result, the aura of magic spread, and only those who entered the Dreamworld could feel its gentleness. Some even treated the breeze as a proof of an existing reality."
    },
    "600120": {
      "id": 600120,
      "text": "Birth and death are inevitable. Even Eddine can't avoid them. As a work of the creator, Eddine will fulfill its mission eventually, and then return to the Dreamworld with butterflies, or disappear with the doom of the Dreamworld. Before that, however, Eddine will still linger here, guiding dream wanderers. Befuddled, Eddine eternally hangs about in the depths of the Dreamworld."
    },
    "600121": {
      "id": 600121,
      "text": "It used to be the inner darkness in people's heart towards the unknown, which materialized to become a monster that deludes and controls minds."
    },
    "600122": {
      "id": 600122,
      "text": "Dark feelings piled up. Dared not to face the reality. Instead, it was shunned and even eventually feared itself, which gave birth to the Fear of Shadow."
    },
    "600123": {
      "id": 600123,
      "text": "The darkness in the Dreamworld started to merge with the darkness in the heart. Finally, it became an aggregation of all sorts of fear. From the bottom of this blackness surged more negative magic, and it finally started its long tread on a perilous road."
    },
    "600124": {
      "id": 600124,
      "text": "When its vessel couldn't hold the fear any longer, the leaked negative feelings and the forbidden magic in the abyss converged, and evolved into the greatest despair. Then, the nightmare formed in the Dreamworld, gnawing at the creature's frame of mind and forcing it down into the abyss."
    },
    "600125": {
      "id": 600125,
      "text": "Roaring in chains, he seems to have lost his mind, with only destructive rage left."
    },
    "600126": {
      "id": 600126,
      "text": "Oladir used to be the best warrior of the tribe. His sturdy build could withstand unimaginable attacks. Even the most feral beasts would fall victim to becoming his prey."
    },
    "600127": {
      "id": 600127,
      "text": "Ereshkigal appreciated his excellent combat ability, and brought him to the Dreamworld by binding his huge body with the Dreamworld Chain and taking control of his soul. In agony, the trapped Oladir lost his pride as a warrior, attacking everything in sight."
    },
    "600128": {
      "id": 600128,
      "text": "Confined by the chain, he gave off an unusual aura of magic. His face barely recognizable due to the corrosion from the abyss."
    },
    "600129": {
      "id": 600129,
      "text": "Gramel was a promising Spell Sorcerer in the magical guards, famous for his talent in the Upper Domain of Cassiel. However, this guy has long lost his mind, radiating an aura of calamity that makes people shudder."
    },
    "600130": {
      "id": 600130,
      "text": "Gramel, the Spell Sorcerer, mastered powerful magic and the forbidden power of the abyss. That's the reason why Ereshkigal took a fancy to him. They bound his soul with the Dreamworld Chain, and trapped him in the Dreamworld. Infinite resentment became his source of magic, and he now curses anyone who enters that world."
    },
    "600131": {
      "id": 600131,
      "text": "Even though he's in chains, his body corroded by the abyss, you can still tell that he was a brave knight, holding a shield and sword in his hands."
    },
    "600132": {
      "id": 600132,
      "text": "The knight of the abyss ahead has lost his glory. His inner painful indignation has nowhere to vent, and now his howls echo throughout the Dreamworld."
    },
    "600133": {
      "id": 600133,
      "text": "A former member of the Frost Chivalric Order in Snegurochka, Diaz Vival swore an oath of loyalty to the respected Protector by his grand Shield, who was bound with the Dreamworld Chain by Ereshkigal. Diaz Vival brandishes his claymore and grand shield, killing any who strayed into the Dreamworld."
    },
    "600134": {
      "id": 600134,
      "text": "A warrior loyal to Ereshkigal, he masters not only magic but also hammer-shaped huge weapons. Anyone who tries to challenge him will suffer a gruesome fate."
    },
    "600135": {
      "id": 600135,
      "text": "Soluk can imbue magic into his maul. After charging for a short period of time, the maul will unleash tremendous energy. You will be taught a lesson if you only treat him as a spell caster."
    },
    "600136": {
      "id": 600136,
      "text": "As a weapon master, Soluk also performs sophisticated conjuring. He can easily choose between physical and magic attacks to deal with his enemies swiftly."
    },
    "600137": {
      "id": 600137,
      "text": "A charged maul strike consumes a large amount of magic, but Soluk's stamina seems inexhaustible. He can enhance his maul with conjuring in mere seconds, and use them to swiftly smite his foes."
    },
    "600138": {
      "id": 600138,
      "text": "By order of Ereshkigal, Soluk assassinated any who disobey. It is said he has mastered all tools of assassin. Killing those who rebelled against the Protector is as easy as breathing to him."
    },
    "600139": {
      "id": 600139,
      "text": "Soluk's swordsmanship can enhance his mind. Concentrated, he will throw himself into the battle, and defeat all of Ereshkigal's foes."
    },
    "600140": {
      "id": 600140,
      "text": "Soluk's ego makes him look down upon and shun the weak. The dagger in his hand speaks for him, finishing off the puny deftly with precision, like a streak of lightning."
    },
    "600141": {
      "id": 600141,
      "text": "Unlike other assassins, Soluk is energetic and can carry out any assassination missions during long periods of time. He often waits patiently through long nights until the flawed target sticks its neck out."
    },
    "600142": {
      "id": 600142,
      "text": "Soluk was once a pure martial artist. To deal with the sorcerers who rebelled against Ereshkigal, he decided to practice magic, and, fortunately, he got the willing help from Ereshkigal. His eagerness to improve hastened the speed of mastering all kinds of advanced magic. Even the sorcerers before, who gloated with huge egos, were no longer match for him.  "
    },
    "600143": {
      "id": 600143,
      "text": "Soluk's fire magic, like his sword, has unbelievable destructive power. He will ruthlessly burn everything in sight."
    },
    "600144": {
      "id": 600144,
      "text": "The spells taught by Ereshkigal also consumes a surprisingly large amount of magic. But for Soluk, it's not a problem. He can restrain an enemy's magic surge and harass his foes, all while carefully observing their actions. Obviously, this proud martial artist quite enjoys the fun of battle."
    },
    "600145": {
      "id": 600145,
      "text": "Soluk's dark magic can erode enemies' mind, dealing continuous damage over a short period of time, and crushing all these who dare to defy Ereshkigal. His absolute loyalty to the Protector makes him an unstoppable killing machine, who has adapted to different combat situations and will defeat his enemies relentlessly.  "
    },
    "600146": {
      "id": 600146,
      "text": ""
    },
    "600147": {
      "id": 600147,
      "text": ""
    },
    "600148": {
      "id": 600148,
      "text": ""
    },
    "600149": {
      "id": 600149,
      "text": ""
    },
    "600150": {
      "id": 600150,
      "text": ""
    },
    "600151": {
      "id": 600151,
      "text": ""
    },
    "600152": {
      "id": 600152,
      "text": ""
    },
    "600153": {
      "id": 600153,
      "text": ""
    },
    "600154": {
      "id": 600154,
      "text": ""
    },
    "600155": {
      "id": 600155,
      "text": ""
    },
    "600156": {
      "id": 600156,
      "text": ""
    },
    "600157": {
      "id": 600157,
      "text": ""
    }
  }
}
